In [1539]:
import re  # import module re
import pandas as pd   # import module pandas
from pandas.io.json import json_normalize  # import json_normalize from pandas  for normalize data gathered from api
import numpy as np    # import module numpy
import requests;       # import module request for SQL connection

# populate the school dictionary with the school name and id

schools = {   
    'flatiron-school' : 10748,
    'general-assembly' :10761,
    'data-science-dojo' : 10685,
    'ironhack' : 10828,
    'le-wagon' : 10868,
    'wild-code-school' : 11169,
    'the-dev-masters' : 11077,
    'byte-academy' : 10574,
    'the-data-incubator' : 11074,
    "brainstation" : 10571,
    }

def get_comments_school(school):
    TAG_RE = re.compile(r'<[^>]+>')
    # defines url to make api call to data -> dynamic with school if you want to scrape competition
    url = "https://www.switchup.org/chimera/v1/school-review-list?mainTemplate=school-review-list&path=%2Fbootcamps%2F" + school + "&isDataTarget=false&page=3&perPage=10000&simpleHtml=true&truncationLength=250"
    #makes get request and converts answer to json
    # url defines the page of all the information, request is made, and information is returned to data variable
    data = requests.get(url).json()
    #converts json to dataframe
    reviews =  pd.DataFrame(data['content']['reviews'])

  
    #aux function to apply regex and remove tags
    def remove_tags(x):
        return TAG_RE.sub('',x)
    reviews['review_body'] = reviews['body'].apply(remove_tags)
    reviews['school'] = school
    return reviews

In [1540]:
def categorize_course_name(course_name):   # create function for caterogize course name
    if course_name is None:    # if course name is None return course = "unknown"
        return 'unknown'
    
    if isinstance(course_name, str):   # if course name is a string
        if ('data'  or 'science'  or 'analytics') in course_name.lower():   # if defined parameter is there return the value
            return 'data analytics'
        elif ('development'  or 'react'  or 'full stack') in course_name.lower():
            return 'web development'
        elif ('ux'  or 'ui'  or 'product'  or 'experience') in course_name.lower():
            return 'ux/ui'
        else:
            return 'others'
    else:
        return 'unknown'

In [1541]:
# could you write this as a list comprehension?
# the list comprehension for the below code is in comment -->> but if i run this code it will return me table with the value
#  mulltiplied by number of school, so i didnot understand why. I prefer to get feedback on this
# comments = [comments.append(get_comments_school(school)) for school in schools.keys()]

comments = []   #creating an empty list to store value comments generated from api

for school in schools.keys():    # iterate the school name and take out comments table from api
    print(school)
    comments.append(get_comments_school(school))     # append the get_comments_school function to generate comment data from schools dictionary

comments = pd.concat(comments)    # store the comment in to pandas dataframe

flatiron-school
general-assembly
data-science-dojo
ironhack
le-wagon
wild-code-school
the-dev-masters
byte-academy
the-data-incubator
brainstation

In [1542]:
comments.head(2)

,id,name,anonymous,hostProgramName,graduatingYear,isAlumni,jobTitle,tagline,body,rawBody,...,queryDate,program,user,overallScore,comments,overall,curriculum,jobSupport,review_body,school
0,297686,Anonymous,True,None,2021.0,False,Software Engineer,Waste of time. They want your money.,"<span class=""truncatable""><p></p><p>I found my...",<p>I found my therapist through Flatiron. That...,...,2023-02-07,Online Software Engineering,{'image': None},1.3,[],1.0,2.0,1.0,I found my therapist through Flatiron. That's ...,flatiron-school
1,290538,Anonymous,True,None,2020.0,False,,Negative experience,"<span class=""truncatable""><p></p><p>I have a m...",<p>I have a money-back guarantee with them for...,...,2022-07-09,None,{'image': None},1.7,[],2.0,2.0,1.0,I have a money-back guarantee with them for jo...,flatiron-school

In [1543]:
comments['school_id'] = comments["school"].map(schools)   # create school_id column in comments DataFrame and store school_id with the corresponding school name.
comments['course_name'] = comments['program'].apply(categorize_course_name)  # create course_name column in comments dataframe and group the course name using specific keyword

In [1580]:
# Drom the column that are not going to use for further analysis
comments.drop(['anonymous', 'hostProgramName', 'body', 'rawBody', "program",  'user', 'comments', 'overallScore','queryDate' ], axis=1, inplace = True, errors='ignore')

In [1545]:
comments.tail(5)

,id,name,graduatingYear,isAlumni,jobTitle,tagline,createdAt,overall,curriculum,jobSupport,review_body,school,school_id,course_name
304,233011,Anonymous,2015.0,True,None,BrainStation's Product Management course helpe...,11/10/2015,5.0,NaN,NaN,I took BrainStation's Product Management cours...,brainstation,10571,others
305,232993,Anonymous,2015.0,True,None,The course offers good continuing education fo...,11/1/2015,3.0,NaN,NaN,The content covered was relevant and interesti...,brainstation,10571,others
306,232987,Anonymous,2015.0,True,None,The Digital Marketing course is structured so ...,10/30/2015,4.0,NaN,NaN,This program has some great insight from peopl...,brainstation,10571,others
307,232910,Anonymous,2015.0,True,None,Built my first iOS app!,10/24/2015,5.0,NaN,NaN,I am enrolled in the Intro to iOS Development ...,brainstation,10571,web development
308,232524,Anonymous,NaN,False,None,Amazing Learning Experience,7/21/2015,5.0,5.0,2.0,I was registered for the digital marketing cla...,brainstation,10571,others

In [1546]:
# rename the column name with the more redable name
comments.rename(columns  = {'id' : 'comment_id', 'name' : 'student_name', 'graduatingYear' : 'graduation_year', 'isAlumni': 'alumni', 'jobTitle' : 'job_title', 'tagline' : 'review_tag', 'createdAt' : 'review_date', 'overall':'overall_rating', 'curriculum': 'course_rating', 'jobSupport': 'support_rating', 'review_body' : 'comment'}, inplace = True)

In [1547]:
# convert the graduation year column in comments DataFrame in to intiger
comments['graduation_year'] = comments.graduation_year.round().astype("Int64")
# uppercase the school name and remove "-" between name separetor
comments['school'] = (comments['school'].str.split('-').str[0:]).apply(lambda x: ' '.join(x)).str.title()
comments.head(4)

,comment_id,student_name,graduation_year,alumni,job_title,review_tag,review_date,overall_rating,course_rating,support_rating,comment,school,school_id,course_name
0,297686,Anonymous,2021,False,Software Engineer,Waste of time. They want your money.,2/7/2023,1.0,2.0,1.0,I found my therapist through Flatiron. That's ...,Flatiron School,10748,others
1,290538,Anonymous,2020,False,,Negative experience,7/9/2022,2.0,2.0,1.0,I have a money-back guarantee with them for jo...,Flatiron School,10748,unknown
2,288383,Anonymous,2021,False,Data Scientist,Great learning Experience,5/2/2022,5.0,5.0,5.0,I had a great learning experience at Flatiron ...,Flatiron School,10748,data analytics
3,286189,Yeva Usatova,2022,False,Software engineer part time,The worst place ever,2/24/2022,1.0,1.0,1.0,If you are working full time and looking for a...,Flatiron School,10748,others

In [1548]:
import mysql.connector  # import mysql connector to make connection with the workbench

In [1549]:
# Import module
import pymysql   
import getpass  # to hide the password of sql workbench
password= getpass.getpass()   # prompt input password

In [1550]:
#  establishing a connection to a database --> group of tables
cnx = mysql.connector.connect(user ='root',
                             password = password,
                             host = 'localhost',
                             database = 'sys',
                             auth_plugin = 'mysql_native_password')

In [1551]:
# check if the connection was successful
cnx.is_connected()

True

In [1552]:
# import the module sqlalchemy ->> it is more easier to export dataframe to sql
from sqlalchemy import create_engine

# create sqlalchemy engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw= password,
                               db="project"))

In [1553]:
# define the cursor
cursor = cnx.cursor()  
cursor

In [1554]:
# create the data base -> in this case "project" ->> if not exist -> this will prevent error if database is already exist
query = ('''CREATE DATABASE IF NOT EXISTS project;''')

In [1555]:
# execute the query
cursor.execute(query)

In [1556]:
# export DataFrame comments to SQL
comments.to_csv("comments.csv")
comments.to_sql("comments", engine, if_exists = 'replace', index = False)

5800

In [1557]:
from pandas import json_normalize

def get_school_info(school, school_id):
    url = 'https://www.switchup.org/chimera/v1/bootcamp-data?mainTemplate=bootcamp-data%2Fdescription&path=%2Fbootcamps%2F'+ str(school) + '&isDataTarget=false&bootcampId='+ str(school_id) + '&logoTag=logo&truncationLength=250&readMoreOmission=...&readMoreText=Read%20More&readLessText=Read%20Less'

    data = requests.get(url).json()

    data.keys()

    courses = data['content']['courses']
    courses_df = pd.DataFrame(courses, columns= ['courses'])

    locations = data['content']['locations']
    locations_df = json_normalize(locations)

    badges_df = pd.DataFrame(data['content']['meritBadges'])
    
    website = data['content']['webaddr']
    description = data['content']['description']
    logoUrl = data['content']['logoUrl']
    school_df = pd.DataFrame([website,description,logoUrl]).T
    school_df.columns =  ['website','description','LogoUrl']

    locations_df['school'] = school
    courses_df['school'] = school
    badges_df['school'] = school
    school_df['school'] = school
    

    locations_df['school_id'] = school_id
    courses_df['school_id'] = school_id
    badges_df['school_id'] = school_id
    school_df['school_id'] = school_id

    return locations_df, courses_df, badges_df, school_df

locations_list = []
courses_list = []
badges_list = []
schools_list = []

for school, id in schools.items():
    print(school)
    a,b,c,d = get_school_info(school,id)
    
    locations_list.append(a)
    courses_list.append(b)
    badges_list.append(c)
    schools_list.append(d)

flatiron-school
general-assembly
data-science-dojo
ironhack
le-wagon
wild-code-school
the-dev-masters
byte-academy
the-data-incubator
brainstation

In [1558]:
locations = pd.concat(locations_list)   # define the DataFrame locations
# drop column that are not going to use in this project
locations.drop(['description','country.id', 'country.abbrev', 'state.id', 'state.abbrev', 'state.keyword', 'city.id', 'city.keyword'], axis = 1, inplace = True, errors = "ignore")
locations.head(2)

      id   country.name state.name city.name           school  school_id
0  15743  United States   New York       NYC  flatiron-school      10748
1  16257            NaN     Online       NaN  flatiron-school      10748

In [1559]:
# rename the locations columns name with more explanatory name 
locations.rename(columns = {'id' : 'location_id', "country.name" : "country_name", 'state.name' : "state_name", 'city.name' : 'city_name'}, inplace = True)
locations['school'] = (locations['school'].str.split('-').str[0:]).apply(lambda x: ' '.join(x)).str.title()
locations.head()

,location_id,country_name,state_name,city_name,school,school_id
0,15743,United States,New York,NYC,Flatiron School,10748
1,16257,NaN,Online,NaN,Flatiron School,10748
2,16761,United States,Colorado,Denver,Flatiron School,10748
3,16958,United Kingdom,NaN,London,Flatiron School,10748
0,16360,United States,New York,NYC,General Assembly,10761

In [1560]:
# save location DataFrame in csv and sent id to sql
locations.to_csv('locations.csv')
locations.to_sql('locations', engine, if_exists = 'replace', index = False)
locations.head(3)

   location_id   country_name state_name city_name           school  school_id
0        15743  United States   New York       NYC  Flatiron School      10748
1        16257            NaN     Online       NaN  Flatiron School      10748
2        16761  United States   Colorado    Denver  Flatiron School      10748

In [1561]:
# create DataFrame courses
courses = pd.concat(courses_list)
courses.head(2)

                     courses           school  school_id
0  Cybersecurity Engineering  flatiron-school      10748
1               Data Science  flatiron-school      10748

In [1562]:
# Add a new column to the DataFrame to store the course categorical name using predefined function
courses['course_name'] = courses['courses'].apply(categorize_course_name)

# Return unique course name of courses in each category
course_list = list(courses['course_name'].unique())
# create list of id for each unique courses
course_id = [1001, 1002, 1003, 1004]
# create new dataframe course_df to store course_name and course_list
course_df = pd.DataFrame({"course_name": course_list, "course_id" : course_id})
course_list

['others', 'data analytics', 'ux/ui', 'web development']

In [1563]:
#  ->>> Below two code need to run only once to create course_list table in sql inorder to  prevent error 
#  course_df.to_csv('course_list.csv')    
# course_df.to_sql('course_list', engine, if_exists = 'replace', index = False)

In [1564]:
# create course_id column in DataFrame courses and assing course id corresponding to course_name
courses['course_id'] = courses['course_name'].map(course_df.set_index('course_name')['course_id'])

In [1565]:
# create new column course_type to classify the type of course
courses['course_type'] = np.where(courses.courses.str.contains('Online', case=False), 'online', 'in-class')

In [1566]:
# upper case the school name and removes "-" seperator inside of school name
courses['school'] = (courses['school'].str.split('-').str[0:]).apply(lambda x: ' '.join(x)).str.title()
courses.head(10)

,courses,school,school_id,course_name,course_id,course_type
0,Cybersecurity Engineering,Flatiron School,10748,others,1001,in-class
1,Data Science,Flatiron School,10748,data analytics,1002,in-class
2,Product Design (UX/UI),Flatiron School,10748,ux/ui,1003,in-class
3,Software Engineering,Flatiron School,10748,others,1001,in-class
4,Flatiron Schoolâ€™s â€˜Intro to Product Designâ€™ le...,Flatiron School,10748,others,1001,in-class
5,Flatiron Schoolâ€™s Learn Cybersecurity for Free...,Flatiron School,10748,others,1001,in-class
6,Flatiron Schoolâ€™s Learn Data Science for Free....,Flatiron School,10748,data analytics,1002,in-class
7,Flatiron Schoolâ€™s Learn to Code for Free. Sign up,Flatiron School,10748,others,1001,in-class
8,Online Cybersecurity Engineering,Flatiron School,10748,others,1001,online
9,Online Data Science,Flatiron School,10748,data analytics,1002,online

In [1567]:
type(courses)

pandas.core.frame.DataFrame

In [1568]:
# we already have categorical name for each courses so drop column courses from courses DataFrame
courses.drop(["courses"], axis = 1, inplace = True, errors = "ignore")
courses.head()

            school  school_id     course_name  course_id course_type
0  Flatiron School      10748          others       1001    in-class
1  Flatiron School      10748  data analytics       1002    in-class
2  Flatiron School      10748           ux/ui       1003    in-class
3  Flatiron School      10748          others       1001    in-class
4  Flatiron School      10748          others       1001    in-class

In [1569]:
# save dataframe as csv and send it as a table to workbench 
courses.to_csv('courses.csv')
courses.to_sql('courses', engine, if_exists = 'replace', index = False)

84

In [1570]:
# 
badges = pd.concat(badges_list)
badges['description'] = badges['description'].str.replace(r'<[^<>]*>', '', regex=True)
badges.drop(["keyword"], axis = 1, inplace = True, errors = "ignore")
badges.head(3)

,name,description,school,school_id
0,Available Online,School offers fully online courses,flatiron-school,10748
1,Verified Outcomes,School publishes a third-party verified outcom...,flatiron-school,10748
2,Flexible Classes,School offers part-time and evening classes,flatiron-school,10748

In [1571]:
badge_list = list(badges.name.unique())
badge_id = [101, 102, 103, 104]
badge_df = pd.DataFrame({"badge": badge_list, "badge_id" : badge_id})
badge_df

               badge  badge_id
0   Available Online       101
1  Verified Outcomes       102
2   Flexible Classes       103
3    Accepts GI Bill       104

In [1572]:
badges['badge_id'] = badges['name'].map(badge_df.set_index('badge')['badge_id'])
badges['school'] = (badges['school'].str.split('-').str[0:]).apply(lambda x: ' '.join(x)).str.title()

badges.head(3)

,name,description,school,school_id,badge_id
0,Available Online,School offers fully online courses,Flatiron School,10748,101
1,Verified Outcomes,School publishes a third-party verified outcom...,Flatiron School,10748,102
2,Flexible Classes,School offers part-time and evening classes,Flatiron School,10748,103

In [1573]:
badges.to_csv('badges.csv')
badges.to_sql('badges', engine, if_exists = 'replace', index = False)

25

In [1574]:
# badge_df.to_csv('badge_id.csv')
# badge_df.to_sql('badges_id', engine, if_exists = 'replace', index = False)

In [1575]:
# any data cleaning still missing here? take a look at the description
schools = pd.concat(schools_list)

schools.drop(['LogoUrl'], axis = 1, inplace = True, errors = 'ignore')
schools['description'] = schools['description'].str.replace(r'<[^<>]*>', '', regex=True)
schools['website'] = schools['website'].str.split('/', n = 1).str[0]
schools['website'] = schools['website'].str.split('?', n = 1).str[0]
schools['school'] = (schools['school'].str.split('-').str[0:]).apply(lambda x: ' '.join(x)).str.title()
schools.head(10)

,website,description,school,school_id
0,flatironschool.com,Founded in 2012 and started the bootcamp revol...,Flatiron School,10748
0,generalassemb.ly,General Assembly is creating a global communit...,General Assembly,10761
0,datasciencedojo.com,Data Science Dojo believes that anyone can lea...,Data Science Dojo,10685
0,www.ironhack.com,Ironhack is a global tech school with 9 campus...,Ironhack,10828
0,www.lewagon.com,Le Wagon is a global leader in immersive tech ...,Le Wagon,10868
0,wildcodeschool.com,Wild Code School offers 5-month web developmen...,Wild Code School,11169
0,www.thedevmasters.com,The goal of theDevMasters is to build the next...,The Dev Masters,11077
0,byteacademy.co,Byte Academy is a leader in industry-oriented ...,Byte Academy,10574
0,www.thedataincubator.com,The Data Incubator is a full-stack data scienc...,The Data Incubator,11074
0,brainstation.io,BrainStation is the global leader in workforce...,Brainstation,10571

In [1576]:
schools.to_csv("schools.csv")
schools.to_sql('schools', engine, if_exists = 'replace', index = False)

10

In [1577]:
cnx.commit

In [1578]:
cursor.close

In [1579]:
cnx.close